<!-- dflook/terraform-github-actions {"workspace":"pull-request-target-harden-2","backend_type":"remote","backend":"73445bd2c9095bc776cb9a3a2dfe0c821f5c4224889e75b916f520cd0da95cde","plan_job_ref":"Job Test Terraform cloud #368 at https://github.com/dflook/terraform-github-actions/actions/runs/21525285355","plan_hash":"95f35089558f9c98e44ee95e00dc94bf4360a9a93ff41e5ce6cd6db06840e2f0","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __pull-request-target-harden-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #368](https://github.com/dflook/terraform-github-actions/actions/runs/21525285355)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>